app/controllers/oems_controller.rb

INSERT INTO `oems` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('theoem', 'oem@gmail.com', '$2a$10$sG5iYHQE2yCpwHwi2TUif.dAIiXsvxwwW/CBFDxJkMMX6DaA60JVS', '2019-05-30 04:03:32', '2019-05-30 04:03:32')
---
  def create
    @oem = Oem.new(oem_params)
    authorize @oem
    if @oem.save