app/controllers/parlaty_admins_controller.rb

def create
	@parlaty_admin = ParlatyAdmin.new(parlaty_admin_params)

	if(@parlaty_admin.save)
---
INSERT INTO `parlaty_admins` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('nick@gmail.com', '$2a$10$HB2ILX.7c0h5DLw8sP1dpukDRTVjnPLfK92lMemzeWl85Md5wftq.', '2019-05-30 03:51:55', '2019-05-30 03:51:55')