app/controllers/procedures_controller.rb

	def operator_prod_index
		# operator itself, OA and Oem associated to operator
		operator = Operator.find(params[:id])
		oemb = OemBusiness.find(operator.oem_business_id)
		arr_of_oa = oemb.operator_admins.pluck(:id)

		if !( is_p_admin?  || cuser_is?("Operator", params[:id]) || cuser_is_in?("OperatorAdmin", arr_of_oa) || cuser_is?("Oem", oemb.oem_id))
			render json: {"error": "Current user access denied"}, status: :forbidden and return
		end

		operations = Operation.where(operator_id: params[:id])
		sorted_op = (operations.sort_by &:last_used).reverse
		# returns an array of the procedures in the sorted operations
		pcd_arr = sorted_op.pluck(:procedure_id)
		@procedures = Procedure.find(pcd_arr)
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 1 LIMIT 1
SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 1 LIMIT 1