app/controllers/procedures_controller.rb

SELECT `steps`.* FROM `steps` WHERE `steps`.`procedure_id` = 1
---
	def show
		authorize @procedure
		@steps = Step.find(@procedure.steps_order) if @procedure.steps_order.present?

SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 1 LIMIT 1
INSERT INTO `procedures` (`name`, `version`, `description`, `category`, `author`, `language`, `created_at`, `updated_at`) VALUES ('The Change of the Century', 1.3, 'This will take you', 'Change', 'Kenneth', 'English', '2019-05-29 06:03:23', '2019-05-29 06:03:23')
---
	def create
		#padmin, oem associated with oem_business in json
		if !(OemBusiness.exists?(id: params[:procedure][:oem_business_id]))
			render json: { "error": "OemBusiness Id doesn't exist"}, status: :bad_request and return
		end

		@procedure = Procedure.new(procedure_params)
		@oemb = OemBusiness.find(params[:procedure][:oem_business_id])
		@oemb.procedures << @procedure

UPDATE `procedures` SET `author` = 'Tammy', `updated_at` = '2019-05-29 06:04:44' WHERE `procedures`.`id` = 2
---
	 def update
		 authorize @procedure
		 if @procedure.update_attributes(procedure_params)

DELETE FROM `procedures` WHERE `procedures`.`id` = 1
---
	def destroy
		authorize @procedure
		if @procedure.destroy

SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 2 LIMIT 1
---
		def set_params
			@procedure = Procedure.find(params[:id])