app/controllers/steps_controller.rb

	def show
		@step = Step.find(params[:id])
---
SELECT  `steps`.* FROM `steps` WHERE `steps`.`id` = 4 LIMIT 1

	def create
		@step = Step.new(step_params)
		@step.procedure_id = params[:procedure_id]

		if(@step.save!)
---
INSERT INTO `steps` (`title`, `device`, `location`, `note`, `created_at`, `updated_at`, `order`, `procedure_id`) VALUES ('blue', 'Cranker', 'east side', 'description about steps', '2019-06-01 02:40:53', '2019-06-01 02:40:53', 4, 1)

	def update
		@step = Step.find(params[:id])
		if(@step.update_attributes(step_params))
---
SELECT  `steps`.* FROM `steps` WHERE `steps`.`id` = 4 LIMIT 1
UPDATE `steps` SET `title` = 'bobo', `device` = 'papa', `location` = 'llol', `note` = 'notne', `order` = 5, `updated_at` = '2019-05-29 00:06:12' WHERE `steps`.`id` = 4

	def destroy
		@step = Step.find(params[:id])
		if(@step.procedure_id != params[:procedure_id])
			render json: { error: 'step does not belong to procedure' }, status: :bad_request and return
		end

		order = @step.order
		if(@step.delete)
			# e.g step 3 gets delete, step 4 til the last step all subtract one
			p_id = params[:procedure_id]
			count = Procedure.find(p_id).steps.count
			# count+1 because @step is already deleted. count will drop 1, but highest order is still old count
			@thesteps = Step.where({order: (order+1)..count+1 , procedure_id: p_id})
			@thesteps.map { |x| x.update_attributes(order: x.order-1) }
---
SELECT  `steps`.* FROM `steps` WHERE `steps`.`id` = 6 LIMIT 1
SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 6 LIMIT 1
DELETE FROM `steps` WHERE `steps`.`id` = 13
SELECT COUNT(*) FROM `steps` WHERE `steps`.`procedure_id` = 2
UPDATE `steps` SET `order` = 3, `updated_at` = '2019-06-03 21:36:25' WHERE `steps`.`id` = 9
SELECT `steps`.* FROM `steps` WHERE `steps`.`order` BETWEEN 5 AND 1 AND `steps`.`procedure_id` = 2

	def reorder
		main_step = Step.find(params[:step_id])
		if(@step.procedure_id != params[:procedure_id])
			render json: { error: 'step does not belong to procedure' }, status: :bad_request and return
		end
		#new position's node before, 0 if new position is top
		new_order_previous = params[:previous_order]
		procedure_id = params[:id]
		order = main_step.order

		change = order - (new_order_previous+1)

		if(change > 0)
			# if change is positive, means moved up, steps between old and new position order +1
			# e.g change from order 5 to order 2, means order 2, 3, 4 all add one
			#update new position, ... excludes "order"
			@thesteps = Step.where({order: (new_order_previous+1)...order, procedure_id: procedure_id})
			@thesteps.map { |x| x.update_attributes(order: x.order+1) }
---
SELECT  `steps`.* FROM `steps` WHERE `steps`.`id` = 1 LIMIT 1
SELECT `steps`.* FROM `steps` WHERE `steps`.`order` BETWEEN 2 AND 4 AND `steps`.`procedure_id` = 1
UPDATE `steps` SET `order` = 4, `updated_at` = '2019-06-01 14:25:52' WHERE `steps`.`id` = 5