app/controllers/steps_controller.rb

SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 1 LIMIT 1
SELECT `steps`.* FROM `steps`
---
	def create
		# oem associated, padmin
		@step = Step.new(step_params)
		@procedure = Procedure.find(@step.procedure_id)
		config.logger.debug "**** POST /steps @procedure.steps_order: " + @procedure.steps_order.to_s
		prev_si = params[:previous_step_id].to_i
		config.logger.debug "**** POST /steps prev_si: " + prev_si.to_s
		pso = @procedure.steps_order

		#zero means step is first order
		if !(pso.include? prev_si or prev_si == 0)