app/controllers/steps_controller.rb

SELECT  `procedures`.* FROM `procedures` WHERE `procedures`.`id` = 1 LIMIT 1
---
	def create
		# oem associated, padmin
		@step = Step.new(step_params)
		@procedure = Procedure.find(@step.procedure_id)
		config.logger.debug "**** POST /steps @procedure.steps_order: " + @procedure.steps_order.to_s
		prev_si = params[:previous_step_id].to_i
		config.logger.debug "**** POST /steps prev_si: " + prev_si.to_s
		pso = @procedure.steps_order

		#zero means step is first order
		if !(pso.include? prev_si or prev_si == 0)
			render json: { "error": "previous step id doesn't exist in procedure_id" }, status: :bad_request and return
		end

		if(@step.save)
			if(prev_si== 0)
				pso.push(@step.id)
			else
				config.logger.debug "**** POST /steps pso 3: " + pso.to_s
				i = pso.index(prev_si)
				pso.insert(i+1, @step.id)
				config.logger.debug "**** POST /steps pso 4: " + pso.to_s
			end
			@step.has_visual = (@step.visuals.count > 0)